app/controllers/products_controller.rb

  def index
    @products = Product.all.order('id ASC').limit(20)
---
SELECT  `products`.* FROM `products`  ORDER BY id ASC LIMIT 20

  def search
    @products = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)
---
SELECT  `products`.* FROM `products` WHERE (title LIKE('%スパイダーマン%')) LIMIT 20